---
kind: enumMember
id: F:Autodesk.Revit.DB.ResourceVersionStatus.Current
enum: Autodesk.Revit.DB.ResourceVersionStatus
source: html/d9fae98e-e39a-9b69-07b9-b77cb777800c.htm
---
# Autodesk.Revit.DB.ResourceVersionStatus.Current

The resource is up-to-date; this is is the most recent version of the resource.